#!/bin/bash

clear

echo "

        ███╗   ███╗██╗██████╗ ███╗   ██╗██╗ ██████╗ ██╗  ██╗████████╗  ████████╗ ██████╗ ██╗  ██╗██╗   ██╗ ██████╗ 
        ████╗ ████║██║██╔══██╗████╗  ██║██║██╔════╝ ██║  ██║╚══██╔══╝  ╚══██╔══╝██╔═══██╗██║ ██╔╝╚██╗ ██╔╝██╔═══██╗
        ██╔████╔██║██║██║  ██║██╔██╗ ██║██║██║  ███╗███████║   ██║        ██║   ██║   ██║█████╔╝  ╚████╔╝ ██║   ██║
        ██║╚██╔╝██║██║██║  ██║██║╚██╗██║██║██║   ██║██╔══██║   ██║        ██║   ██║   ██║██╔═██╗   ╚██╔╝  ██║   ██║
        ██║ ╚═╝ ██║██║██████╔╝██║ ╚████║██║╚██████╔╝██║  ██║   ██║        ██║   ╚██████╔╝██║  ██╗   ██║   ╚██████╔╝
        ╚═╝     ╚═╝╚═╝╚═════╝ ╚═╝  ╚═══╝╚═╝ ╚═════╝ ╚═╝  ╚═╝   ╚═╝        ╚═╝    ╚═════╝ ╚═╝  ╚═╝   ╚═╝    ╚═════╝                
                                            
                                            Reboot Setup Script
"


rocket="🚀"
motion="🏃"
done="✅"
warning="⚠️"
error="❌"
icons="🎆"
files_and_folders="📁"
reboot="🔁"
ok="👌"

echo "=== ${reboot} Section: Reboot System ==="
echo "${reboot} Do you want to reboot your system? (Enter 'yes' or 'no')"
read -r choice

choice=$(echo "$choice" | tr '[:upper:]' '[:lower:]' | xargs) # Convert to lowercase and remove leading/trailing whitespace

if [[ "$choice" == "yes" || "$choice" == "y" ]]; then
    echo -e "\n${reboot} Rebooting the system..."
    sleep 3
    reboot
elif [[ "$choice" == "no" || "$choice" == "n" ]]; then
    echo -e "\n${ok} No reboot requested. Exiting..."
else
    echo -e "\n${error} Invalid choice. No reboot requested. Exiting..."
fi